Updates for open source uptake
